app/views/articles/index.html.erb

SELECT "articles".* FROM "articles"
SELECT COUNT(*) FROM "articles" WHERE "articles"."category_id" = ?  [["category_id", 2]]
---
                  </div>
                  <span class="badge bg-primary rounded-pill mx-3 "><%= category.articles.count %></span></li>

SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 9]]
---
                          <span class="space-comment"></span>
                          <small class=""><i class="fa fa-commenting-o"></i> <%= article.comments.count %> </small>