app/views/articles/index.html.erb

                  </div>
                  <span class="badge bg-primary rounded-pill mx-3 "><%= category.articles.count %></span></li>
---
SELECT "articles".* FROM "articles"