app/controllers/articles_controller.rb

  def index
    @categories = Category.all
    category = params[:category]
    if !category.nil?
      @articles = Article.where(:category_id => category)
    else
    @articles = Article.all.reverse()
---
SELECT "categories".* FROM "categories"
SELECT "articles".* FROM "articles" WHERE "articles"."category_id" = ?  [["category_id", 4]]
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show
    # binding.pry
    @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def create

    @article = Article.new(article_params)
    # binding.pry
    @article.account = current_account

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "account_id", "category_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Java"], ["body", nil], ["created_at", "2022-09-12 05:50:33.115213"], ["updated_at", "2022-09-12 05:50:33.115213"], ["account_id", 9], ["category_id", 2]]

  def update
    @article= Article.find(params[:id])
    if @article.update(article_params)
---
UPDATE "articles" SET "updated_at" = ? WHERE "articles"."id" = ?  [["updated_at", "2022-09-12 05:50:33.141316"], ["id", 11]]