app/controllers/categories_controller.rb

  def create

    @category = Category.new(category_params)
    if @category.save
---
INSERT INTO "categories" ("category", "created_at", "updated_at") VALUES (?, ?, ?)  [["category", "Javascript"], ["created_at", "2022-09-07 11:54:12.467279"], ["updated_at", "2022-09-07 11:54:12.467279"]]