app/controllers/comments_controller.rb

def create
	@article = Article.find(params[:article_id])
	@comment = @article.comments.create(comment_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "article_id", "created_at", "updated_at", "account_id") VALUES (?, ?, ?, ?, ?)  [["commenter", "hello check"], ["article_id", 9], ["created_at", "2022-09-09 09:44:53.217849"], ["updated_at", "2022-09-09 09:44:53.217849"], ["account_id", 5]]